// დღევანდელი დავალება ჯს-

// 🆘 შევქმნათ ფუნქცია რომელიც პარამეტრად მიიღებს სტრინგს, ფუნქციამ უნდა დავიბრუნოს უკუღმად ეს სტრინგი. თუ ეს სტრინგი პალინფრომია ანუ როგორც წინიდან ისე უკნიდან ერთნაირად იკითხება, უნდა დაგვიბრუნდეს ესე: ეს სტრინგი პალინფრომია და თუ არ არის შესაბამისად, ეს სტრინგი არ არის პალინდრომი

function myFunc(str) {
  if (str.split("").reverse().join("").toLowerCase() == str.toLowerCase()) {
    console.log(" ეს სტრინგი პალინფრომი");
  } else {
    console.log(" ეს სტრინგი არ არის პალინფრომი");
  }
}

myFunc("ANA");
